In [1]:
# 데이터프레임 생성
import pandas as pd
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df = pd.DataFrame(dict_data)
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [2]:
# 2차원 배열 전환시 행인덱스와 열이름 직접 지정 가능
import pandas as pd
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [3]:
# 데이터프레임 객체에 대한 인덱스와 열 이름을 지정하는 방법
import pandas as pd
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])

df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [4]:
# 데이터프레임 객체의 특정 행 인덱스와 열 이름을 변경하려는 경우
import pandas as pd
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index=['준서','예은'],
                 columns=['나이','성별','학교'])

df.rename(columns={'나이':'연령'}, inplace=True)
df.rename(index={'준서':'학생1'}, inplace=True)
print(df)

     연령 성별   학교
학생1  15  남  덕영중
예은   17  여  수리중

In [5]:
# 데이터프레임 변환
# 데이터프레임 생성 연습
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [6]:
# drop()함수의 축을 지정하는 axis의 옵션을 이용해 행(=0)/열(=1) 선택
df.drop('우현', inplace=True)
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [7]:
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])
df.drop(['수학','음악'], axis=1, inplace=True)
print(df)

    영어   체육
서준  98  100
우현  89   90
인아  95   90

In [8]:
# 행,열,원소 선택
# 1. .loc : 인덱스이름
# 2. .iloc : 정수형위치인덱스
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])
df.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [9]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [10]:
df.loc['서준':'우현']

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [11]:
df.iloc[0:1]

    수학  영어  음악   체육
서준  90  98  85  100

In [12]:
df.iloc[0:2]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [13]:
# 열선택:'열이름'형태로 직접 지정하거나, 리스트 형태로 열이름을 지정
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [14]:
df.수학

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [15]:
df[['음악','체육']]

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [16]:
# 원소선택 : 행이름과 열이름을 [행,열]형식의 2차원 좌표로 입력
df.loc['서준','음악']

85

In [17]:
df.iloc[0,2]

85

In [18]:
df.loc['서준',['음악','체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [19]:
df.iloc[0,[2,3]]

음악     85
체육    100
Name: 서준, dtype: int64

In [20]:
# 행추가 : 추가하려는 행이름과 데이터값을 loc인덱서를 이용하여 입력
df.loc['현정']=[75,82,98,95]
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
현정  75  82   98   95

In [21]:
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])

In [22]:
# 열추가 : 추가하려는 열이름과 데이터값을 직접 할당하여 입력
df['국어']=80
print(df)

    수학  영어   음악   체육  국어
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [23]:
df['과학']=[80,92,85]
print(df)

    수학  영어   음악   체육  국어  과학
서준  90  98   85  100  80  80
우현  80  89   95   90  80  92
인아  70  95  100   90  80  85

In [24]:
# 데이터프레임의 특정 여러 원소를 선택하고 새로운 데이터값을 지정
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])

df.loc['서준',['음악','체육']]=[100,50]
print(df)

    수학  영어   음악  체육
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

In [25]:
# 전치행렬을 만들어주는 transpose() 함수 이용
import pandas as pd
df = pd.DataFrame([[90,98,85,100],[80,89,95,90],[70,95,100,90]],
                 index = ['서준','우현','인아'],
                 columns = ['수학','영어','음악','체육'])
df.transpose()

     서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [26]:
# 데이터프레임 정렬
# 데이터프레임 생성
import pandas as pd
df = pd.DataFrame([[1,4,7,10,13],[2,5,8,11,14],[3,6,9,12,15]],
                 index=['r0','r1','r2'],
                 columns=['c0','c1','c2','c3','c4'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [27]:
# sort_index()를 사용하여 행인덱스의 값을 오름차순 또는 내림차순 정렬
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [29]:
# sort_values()를 이용해 특정열의 데이터값을 기준으로 정렬
df.sort_values(by='c1', ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [30]:
# 데이터분석 실습
import pandas as pd
exam_data = {'이름':['철수','민지','영미','한솔'],
            '나이':[12,21,18,26],
            '직업':['중학생','대학생','고등학생','회사원']}

# 딕셔너리를 데이터프레임으로 생성
df = pd.DataFrame(exam_data)
print(df)

   이름  나이    직업
0  철수  12   중학생
1  민지  21   대학생
2  영미  18  고등학생
3  한솔  26   회사원

In [31]:
# 데이터프레임 열이름 수정
df.rename(columns={'나이':'연령'}, inplace=True)

In [32]:
print(df)

   이름  연령    직업
0  철수  12   중학생
1  민지  21   대학생
2  영미  18  고등학생
3  한솔  26   회사원

In [33]:
# 데이터프레임의 특정열 삭제
df.drop(['직업'], axis=1, inplace=True)

In [34]:
print(df)

   이름  연령
0  철수  12
1  민지  21
2  영미  18
3  한솔  26

In [35]:
# 특정 데이터 조회
df.iloc[1,1]

21

In [36]:
# 열선택
df.이름

0    철수
1    민지
2    영미
3    한솔
Name: 이름, dtype: object

In [37]:
df['이름']

0    철수
1    민지
2    영미
3    한솔
Name: 이름, dtype: object

In [38]:
# 데이터프레임정렬
df.sort_values(by='연령', ascending=False)

   이름  연령
3  한솔  26
1  민지  21
2  영미  18
0  철수  12